In [147]:
# 범주 이름 붙이기
df5["grade"].cat.categories = ["very good", "good", "very bad"]
df5

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
# Series
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [9]:
# [[]] 이면 DataFrame으로..
df[["a"]]

   a
1  4
2  5
3  6

In [6]:
# date_range -> 
# pd.date_range('1/1/2017', '12/31/2017', freq='W-MON') 월요일만 추출
# pd.date_range(start='12/10/2017', periods=4, freq='D') 4일치 날짜를 추출
dates = pd.date_range("20210101", periods=6) # 2021년 1월 1일 부터 6일치 날짜를 추출
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
# numpy as np
# np.random.randInt 균일 분포의 정수 난수 1개 생성
# np.random.rand    0부터 1사이의 균일분포에서 난수 행렬 배열 생성
# np.random.randn   가우시안 표준 정규 분포에서 난수 행렬 배열 생성
df2 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
# 행렬 배열 (6x4)
df2

                   A         B         C         D
2021-01-01  0.952779  0.315940  0.153472  0.356936
2021-01-02  0.339225 -0.166911 -0.519431 -2.073599
2021-01-03  1.507226 -0.519761  1.690711 -0.507602
2021-01-04  0.660243 -1.371607  0.548405 -0.519238
2021-01-05  2.153474  0.810626 -1.349950  0.284011
2021-01-06  0.423811 -1.312050 -0.892476 -0.879487

In [13]:
# Series와 같은 것으로 변환될 수 있는 객체들의 dict로 구성된 DataFrame 생성
# https://kongdols-room.tistory.com/53
df3 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20210101"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df3

     A          B    C  D      E    F
0  1.0 2021-01-01  1.0  3   test  foo
1  1.0 2021-01-01  1.0  3  train  foo
2  1.0 2021-01-01  1.0  3   test  foo
3  1.0 2021-01-01  1.0  3  train  foo

In [14]:
#dtype -> 자료형
df3.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
# Viewing data 

# df.head() 앞에서 윗 5줄을 불러옴 (default = 5)
# df.tail() 끝에서 마지막 5줄을 불러옴 (default = 5)
df.head()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [17]:
df.tail(1)

   a  b   c
3  6  9  12

In [18]:
df2.head(1)

                   A         B         C         D
2021-01-01  0.204788  1.379574 -2.566273 -0.533431

In [19]:
df2.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [21]:
df2.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
df2.values

array([[ 0.20478811,  1.37957397, -2.56627328, -0.53343131],
       [-0.50338249, -0.0693436 , -0.32652265,  0.33597008],
       [-0.92664404,  0.32220983,  1.33890786, -0.10655752],
       [-0.80925865,  0.3265626 , -1.20627752,  0.85891536],
       [-0.79967328,  0.20736745,  0.3675465 ,  2.19349445],
       [ 0.20965618, -2.1972934 ,  0.638939  , -0.12109961]])

In [24]:
# describe()는 데이터의 대략적인 통계적 정보 요약을 보여줌
df2.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.437419 -0.005154 -0.292280  0.437882
std    0.518521  1.182323  1.412156  0.982054
min   -0.926644 -2.197293 -2.566273 -0.533431
25%   -0.806862 -0.000166 -0.986339 -0.117464
50%   -0.651528  0.264789  0.020512  0.114706
75%    0.027745  0.325474  0.571091  0.728179
max    0.209656  1.379574  1.338908  2.193494

In [25]:
df.describe()

         a    b     c
count  3.0  3.0   3.0
mean   5.0  8.0  11.0
std    1.0  1.0   1.0
min    4.0  7.0  10.0
25%    4.5  7.5  10.5
50%    5.0  8.0  11.0
75%    5.5  8.5  11.5
max    6.0  9.0  12.0

In [26]:
df2

                   A         B         C         D
2021-01-01  0.204788  1.379574 -2.566273 -0.533431
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970
2021-01-03 -0.926644  0.322210  1.338908 -0.106558
2021-01-04 -0.809259  0.326563 -1.206278  0.858915
2021-01-05 -0.799673  0.207367  0.367547  2.193494
2021-01-06  0.209656 -2.197293  0.638939 -0.121100

In [27]:
# 데이터 전치
df2.T

   2021-01-01  2021-01-02  2021-01-03  2021-01-04  2021-01-05  2021-01-06
A    0.204788   -0.503382   -0.926644   -0.809259   -0.799673    0.209656
B    1.379574   -0.069344    0.322210    0.326563    0.207367   -2.197293
C   -2.566273   -0.326523    1.338908   -1.206278    0.367547    0.638939
D   -0.533431    0.335970   -0.106558    0.858915    2.193494   -0.121100

In [29]:
# https://hogni.tistory.com/49
# axis (0 = 행정렬, 1= 열정렬)
# ascending 오름차순
df2.sort_index(axis=1, ascending=False)

                   D         C         B         A
2021-01-01 -0.533431 -2.566273  1.379574  0.204788
2021-01-02  0.335970 -0.326523 -0.069344 -0.503382
2021-01-03 -0.106558  1.338908  0.322210 -0.926644
2021-01-04  0.858915 -1.206278  0.326563 -0.809259
2021-01-05  2.193494  0.367547  0.207367 -0.799673
2021-01-06 -0.121100  0.638939 -2.197293  0.209656

In [30]:
df2.sort_index(axis=0, ascending=False)

                   A         B         C         D
2021-01-06  0.209656 -2.197293  0.638939 -0.121100
2021-01-05 -0.799673  0.207367  0.367547  2.193494
2021-01-04 -0.809259  0.326563 -1.206278  0.858915
2021-01-03 -0.926644  0.322210  1.338908 -0.106558
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970
2021-01-01  0.204788  1.379574 -2.566273 -0.533431

In [31]:
# by = 값별로 정렬
df2.sort_values(by='B')

                   A         B         C         D
2021-01-06  0.209656 -2.197293  0.638939 -0.121100
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970
2021-01-05 -0.799673  0.207367  0.367547  2.193494
2021-01-03 -0.926644  0.322210  1.338908 -0.106558
2021-01-04 -0.809259  0.326563 -1.206278  0.858915
2021-01-01  0.204788  1.379574 -2.566273 -0.533431

In [35]:
# Selection
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [36]:
df['a']

1    4
2    5
3    6
Name: a, dtype: int64

In [37]:
# 탐색 영역 지정
df[0:2]

   a  b   c
1  4  7  10
2  5  8  11

In [38]:
# 인덱스로 탐색할 수도 있다.
df2['20210101':'20210103']

                   A         B         C         D
2021-01-01  0.204788  1.379574 -2.566273 -0.533431
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970
2021-01-03 -0.926644  0.322210  1.338908 -0.106558

In [41]:
# dates[0] == '20210101' 의 모든 column을 인덱싱
df2.loc[dates[0]]

A    0.204788
B    1.379574
C   -2.566273
D   -0.533431
Name: 2021-01-01 00:00:00, dtype: float64

In [40]:
df2

                   A         B         C         D
2021-01-01  0.204788  1.379574 -2.566273 -0.533431
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970
2021-01-03 -0.926644  0.322210  1.338908 -0.106558
2021-01-04 -0.809259  0.326563 -1.206278  0.858915
2021-01-05 -0.799673  0.207367  0.367547  2.193494
2021-01-06  0.209656 -2.197293  0.638939 -0.121100

In [42]:
# 모든 row의 A,B 인덱싱
df2.loc[:,['A','B']]

                   A         B
2021-01-01  0.204788  1.379574
2021-01-02 -0.503382 -0.069344
2021-01-03 -0.926644  0.322210
2021-01-04 -0.809259  0.326563
2021-01-05 -0.799673  0.207367
2021-01-06  0.209656 -2.197293

In [44]:
df2.loc['20210101':'20210103', ['A','B']]

                   A         B
2021-01-01  0.204788  1.379574
2021-01-02 -0.503382 -0.069344
2021-01-03 -0.926644  0.322210

In [45]:
# 스칼라 값
df2.at[dates[0],'A']

0.2047881093624374

In [46]:
# 3번째 행 출력
df2.iloc[3]

A   -0.809259
B    0.326563
C   -1.206278
D    0.858915
Name: 2021-01-04 00:00:00, dtype: float64

In [48]:
# 3:5행 0:2열 출력
df2.iloc[3:5, 0:2]

                   A         B
2021-01-04 -0.809259  0.326563
2021-01-05 -0.799673  0.207367

In [49]:
# 1,2,4 행 0,2열 출력
df2.iloc[[1,2,4],[0,2]]

                   A         C
2021-01-02 -0.503382 -0.326523
2021-01-03 -0.926644  1.338908
2021-01-05 -0.799673  0.367547

In [50]:
# 1:3행 전체 열 출력
df2.iloc[1:3,:]

                   A         B         C         D
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970
2021-01-03 -0.926644  0.322210  1.338908 -0.106558

In [51]:
# 특정 값 추출 -> df.iat[1,1] 과 동일
df2.iloc[1,1]

-0.06934359504094248

In [52]:
# 조건을 총족하는 값만을 출력
df2[df2 > 0]

                   A         B         C         D
2021-01-01  0.204788  1.379574       NaN       NaN
2021-01-02       NaN       NaN       NaN  0.335970
2021-01-03       NaN  0.322210  1.338908       NaN
2021-01-04       NaN  0.326563       NaN  0.858915
2021-01-05       NaN  0.207367  0.367547  2.193494
2021-01-06  0.209656       NaN  0.638939       NaN

In [53]:
# 두 개 이상의 값을 불러 올때는 DataFrame 형태로 불러와야 함
df2[["A", "B"]]

                   A         B
2021-01-01  0.204788  1.379574
2021-01-02 -0.503382 -0.069344
2021-01-03 -0.926644  0.322210
2021-01-04 -0.809259  0.326563
2021-01-05 -0.799673  0.207367
2021-01-06  0.209656 -2.197293

In [54]:
dfCopy = df2.copy()
dfCopy['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
dfCopy

                   A         B         C         D      E
2021-01-01  0.204788  1.379574 -2.566273 -0.533431    one
2021-01-02 -0.503382 -0.069344 -0.326523  0.335970    one
2021-01-03 -0.926644  0.322210  1.338908 -0.106558    two
2021-01-04 -0.809259  0.326563 -1.206278  0.858915  three
2021-01-05 -0.799673  0.207367  0.367547  2.193494   four
2021-01-06  0.209656 -2.197293  0.638939 -0.121100  three

In [55]:
# 필터링 (isin)
dfCopy[dfCopy['E'].isin(['two','four'])]

                   A         B         C         D     E
2021-01-03 -0.926644  0.322210  1.338908 -0.106558   two
2021-01-05 -0.799673  0.207367  0.367547  2.193494  four

In [56]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [60]:
df2['F'] = s
df2.at[dates[0],'A'] = 0
df2.iat[0,1] = 0
df2.loc[:,'D'] = np.array([5] * len(df2))
df2

                   A         B         C  D   F
2021-01-01  0.000000  0.000000 -2.566273  5 NaN
2021-01-02 -0.503382 -0.069344 -0.326523  5 NaN
2021-01-03 -0.926644  0.322210  1.338908  5 NaN
2021-01-04 -0.809259  0.326563 -1.206278  5 NaN
2021-01-05 -0.799673  0.207367  0.367547  5 NaN
2021-01-06  0.209656 -2.197293  0.638939  5 NaN

In [70]:
# Missing Data (결측치)

# 결측치를 표현하기 위해 주로 np.nan 값을 사용, 계산에는 반영되지 않음
# Reindexing으로 지정된 축 상의 인덱스를 변경 / 추가 / 삭제할 수 있고 기본적으로 데이터의 복사본을 반환.
df1 = df2.reindex(index=dates[0:4], columns=list(df2.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D   F    E
2021-01-01  0.000000  0.000000 -2.566273  5 NaN  1.0
2021-01-02 -0.503382 -0.069344 -0.326523  5 NaN  1.0
2021-01-03 -0.926644  0.322210  1.338908  5 NaN  NaN
2021-01-04 -0.809259  0.326563 -1.206278  5 NaN  NaN

In [71]:
# F 칼럼 지우기

df1 = df1.drop(['F'], axis=1)
df1

                   A         B         C  D    E
2021-01-01  0.000000  0.000000 -2.566273  5  1.0
2021-01-02 -0.503382 -0.069344 -0.326523  5  1.0
2021-01-03 -0.926644  0.322210  1.338908  5  NaN
2021-01-04 -0.809259  0.326563 -1.206278  5  NaN

In [72]:
# 결측치(NaN)을 가지고 있는 행 삭제

df1.dropna(how='any')

                   A         B         C  D    E
2021-01-01  0.000000  0.000000 -2.566273  5  1.0
2021-01-02 -0.503382 -0.069344 -0.326523  5  1.0

In [75]:
# 결측치에 임의의 값을 채울 수도 있음
df1.fillna(value=3)

                   A         B         C  D    E
2021-01-01  0.000000  0.000000 -2.566273  5  1.0
2021-01-02 -0.503382 -0.069344 -0.326523  5  1.0
2021-01-03 -0.926644  0.322210  1.338908  5  3.0
2021-01-04 -0.809259  0.326563 -1.206278  5  3.0

In [76]:
# DataFrame의 모든 값이 boolean 형태로 표시되도록 하며, nan인 값에만 True가 표시되게 하는 함수

pd.isna(df1)

                A      B      C      D      E
2021-01-01  False  False  False  False  False
2021-01-02  False  False  False  False  False
2021-01-03  False  False  False  False   True
2021-01-04  False  False  False  False   True

In [81]:
# Operation (연산)
# mean 평균
# https://nittaku.tistory.com/113
df1.mean()

A   -0.559821
B    0.144857
C   -0.690041
D    5.000000
E    1.000000
dtype: float64

In [82]:
df1.mean(1)

2021-01-01    0.686745
2021-01-02    1.020150
2021-01-03    1.433618
2021-01-04    0.827757
Freq: D, dtype: float64

In [90]:
# shift함수는 말그대로 쉬프트한다. 아래코드에서 1,3,4,np.nan,6,8 순으로 시리즈가 적용되어야하나 shiff(1)의 영향으로 0번째 인덱스를 건너뛰고 1번부터 적용된 것을 볼 수 있다.
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(1)
s

2021-01-01    NaN
2021-01-02    1.0
2021-01-03    3.0
2021-01-04    5.0
2021-01-05    NaN
2021-01-06    6.0
Freq: D, dtype: float64

In [91]:
# 합계

df1.sub(s, axis='index')

                   A         B         C    D    E
2021-01-01       NaN       NaN       NaN  NaN  NaN
2021-01-02 -1.503382 -1.069344 -1.326523  4.0  0.0
2021-01-03 -3.926644 -2.677790 -1.661092  2.0  NaN
2021-01-04 -5.809259 -4.673437 -6.206278  0.0  NaN
2021-01-05       NaN       NaN       NaN  NaN  NaN
2021-01-06       NaN       NaN       NaN  NaN  NaN

In [93]:
# https://m.blog.naver.com/PostView.nhn?blogId=allenpython&logNo=220401132533&proxyReferer=https%3A%2F%2Fwww.google.com%2F

# cumsum은 배열에서 주어진 축에 따라 누적되는 원소들의 누적 합을 계산하는 함수
# a = np.array([[1, 2, 3], [4, 5, 6]]) 일 경우, np.cumsum(a)를 하게 되면
# 1 3 6 10 15 21 처럼 더한 값이 누적되어 출력된다.

df1.apply(np.cumsum)

                   A         B         C   D    E
2021-01-01  0.000000  0.000000 -2.566273   5  1.0
2021-01-02 -0.503382 -0.069344 -2.892796  10  2.0
2021-01-03 -1.430027  0.252866 -1.553888  15  NaN
2021-01-04 -2.239285  0.579429 -2.760166  20  NaN

In [96]:
# https://sacko.tistory.com/52
# lambda 로 익명함수 x를 만들어 계산되었다.
df1.apply(lambda x: x.max() - x.min())

A    0.926644
B    0.395906
C    3.905181
D    0.000000
E    0.000000
dtype: float64

In [97]:
# Histogramming (히스토그래밍)
# np.random.randInt 균일 분포의 정수 난수 1개 생성
# np.random.rand    0부터 1사이의 균일분포에서 난수 행렬 배열 생성
# np.random.randn   가우시안 표준 정규 분포에서 난수 행렬 배열 생성

s = pd.Series(np.random.randint(0, 7, size=10))
s

0    0
1    6
2    0
3    2
4    6
5    6
6    5
7    4
8    5
9    1
dtype: int64

In [98]:
# value_counts() -> 빈도 수 계산
s.value_counts()

6    3
5    2
0    2
4    1
2    1
1    1
dtype: int64

In [99]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [101]:
# Merge (병합)
df4 = pd.DataFrame(np.random.randn(10, 4))
df4

          0         1         2         3
0  1.594228 -0.567756 -0.233275 -0.691846
1  0.794628 -0.264233  1.034103  1.215507
2 -0.249236  0.897544  0.495048  1.410424
3  0.996473  0.822834  1.463317  0.383410
4 -0.189322 -0.710448 -0.462119 -0.225109
5  0.055322  0.394612  1.304284 -0.617587
6 -1.106075  0.653726 -1.761748  2.244211
7 -1.348656 -0.807591  0.027689  0.608488
8  0.791371 -0.505865  0.851559  1.396177
9  0.548955 -0.267065 -0.519139  0.410796

In [102]:
# concat()으로 pandas 객체를 연결

pieces = [df4[:3], df4[3:7], df4[7:]]
pd.concat(pieces)

          0         1         2         3
0  1.594228 -0.567756 -0.233275 -0.691846
1  0.794628 -0.264233  1.034103  1.215507
2 -0.249236  0.897544  0.495048  1.410424
3  0.996473  0.822834  1.463317  0.383410
4 -0.189322 -0.710448 -0.462119 -0.225109
5  0.055322  0.394612  1.304284 -0.617587
6 -1.106075  0.653726 -1.761748  2.244211
7 -1.348656 -0.807591  0.027689  0.608488
8  0.791371 -0.505865  0.851559  1.396177
9  0.548955 -0.267065 -0.519139  0.410796

In [106]:
# Join (결합)
# 주목해야할 부분은 SQL 방식으로 결합한다는 것이다. 

left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [107]:
right

   key  rval
0  foo     4
1  bar     5

In [108]:
# 병합

pd.merge(left, right, on= 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [110]:
# Append (추가)
# 데이터프레임에 행을 추가

df4 = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df4

          A         B         C         D
0 -0.392019  1.667203  0.376611 -0.789239
1  0.525399  0.314369  1.380849 -0.599564
2  0.539091  0.805776  1.050621  3.210388
3 -0.533862 -0.677642 -0.755451 -1.635982
4 -1.543721  0.558632  0.926358 -1.297006
5  0.249124 -0.351860 -1.351736  0.546610
6  1.016791  1.082724 -1.042776 -1.071976
7  0.867282 -0.120478 -0.438404 -0.819020

In [112]:
s = df4.iloc[3]
s

A   -0.533862
B   -0.677642
C   -0.755451
D   -1.635982
Name: 3, dtype: float64

In [113]:
df4.append(s, ignore_index=True)

          A         B         C         D
0 -0.392019  1.667203  0.376611 -0.789239
1  0.525399  0.314369  1.380849 -0.599564
2  0.539091  0.805776  1.050621  3.210388
3 -0.533862 -0.677642 -0.755451 -1.635982
4 -1.543721  0.558632  0.926358 -1.297006
5  0.249124 -0.351860 -1.351736  0.546610
6  1.016791  1.082724 -1.042776 -1.071976
7  0.867282 -0.120478 -0.438404 -0.819020
8 -0.533862 -0.677642 -0.755451 -1.635982

In [114]:
# Grouping (그룹화)

# 몇몇 기준에 따라 여러 그룹으로 데이터를 분할 (splitting)
# 각 그룹에 독립적으로 함수를 적용 (applying)
# 결과물들을 하나의 데이터 구조로 결합 (combining)

df4 = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)
df4

     A      B         C         D
0  foo    one  0.798312  0.374901
1  bar    one  0.563092 -1.034419
2  foo    two  1.648219 -0.228789
3  bar  three  1.449834  0.554625
4  foo    two -0.413664 -0.290243
5  bar    two -0.235334  0.191682
6  foo    one -0.623011 -0.429641
7  foo  three  1.222500 -1.261019

In [116]:
# A 컬럼값을 groupby하여 합계 구하기

df4.groupby('A').sum()

            C         D
A
bar  1.777592 -0.288112
foo  2.632357 -1.834790

In [118]:
# A 컬럼값을 Groupby하여 B의 컬럼값 평균값 구하기 

df4.groupby(['A','B']).mean()

                  C         D
A   B
bar one    0.563092 -1.034419
    three  1.449834  0.554625
    two   -0.235334  0.191682
foo one    0.087651 -0.027370
    three  1.222500 -1.261019
    two    0.617278 -0.259516

In [120]:
# pivot_table로 평균값 구하기

pd.pivot_table(df4, index="A")

            C         D
A
bar  0.592531 -0.096037
foo  0.526471 -0.366958

In [121]:
# Stack(스택)

tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df4 = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df5  =  df4[:4]
df5

                     A         B
first second
bar   one    -1.425195 -0.859343
      two     0.409136  0.338427
baz   one     1.584450  1.268736
      two     1.219449  1.295447

In [122]:
stacked = df5.stack()
stacked

first  second
bar    one     A   -1.425195
               B   -0.859343
       two     A    0.409136
               B    0.338427
baz    one     A    1.584450
               B    1.268736
       two     A    1.219449
               B    1.295447
dtype: float64

In [123]:
# 역 연산

stacked.unstack()

                     A         B
first second
bar   one    -1.425195 -0.859343
      two     0.409136  0.338427
baz   one     1.584450  1.268736
      two     1.219449  1.295447

In [124]:
stacked.unstack(1)

second        one       two
first
bar   A -1.425195  0.409136
      B -0.859343  0.338427
baz   A  1.584450  1.219449
      B  1.268736  1.295447

In [125]:
stacked.unstack(0)

first          bar       baz
second
one    A -1.425195  1.584450
       B -0.859343  1.268736
two    A  0.409136  1.219449
       B  0.338427  1.295447

In [130]:
# Time Series (시계열)
# https://predictors.tistory.com/28

rng = pd.date_range('1/1/2021', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2021-01-01    24719
Freq: 5T, dtype: int64

In [131]:
rng = pd.date_range('4/4/2021 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2021-04-04   -0.347807
2021-04-05   -0.765978
2021-04-06    0.581024
2021-04-07    0.982986
2021-04-08    1.673466
Freq: D, dtype: float64

In [132]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2021-04-04 00:00:00+00:00   -0.347807
2021-04-05 00:00:00+00:00   -0.765978
2021-04-06 00:00:00+00:00    0.581024
2021-04-07 00:00:00+00:00    0.982986
2021-04-08 00:00:00+00:00    1.673466
Freq: D, dtype: float64

In [140]:
# 기간 ↔ 시간 변환

rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -0.259078
2012-02-29    0.238526
2012-03-31   -0.404884
2012-04-30   -0.664089
2012-05-31   -1.784916
Freq: M, dtype: float64

In [141]:
# 일 제거

ps = ts.to_period()
ps

2012-01   -0.259078
2012-02    0.238526
2012-03   -0.404884
2012-04   -0.664089
2012-05   -1.784916
Freq: M, dtype: float64

In [142]:
# 복호화

ps.to_timestamp()
ps

2012-01   -0.259078
2012-02    0.238526
2012-03   -0.404884
2012-04   -0.664089
2012-05   -1.784916
Freq: M, dtype: float64

In [143]:
# 달마다 오전9시로 표시

prng = pd.period_range('2020Q1', '2021Q4', freq='Q-NOV') # 1분기 ~ 4분기
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

2020-03-01 09:00    1.070404
2020-06-01 09:00   -2.065572
2020-09-01 09:00   -0.576365
2020-12-01 09:00   -0.352169
2021-03-01 09:00   -0.883337
Freq: H, dtype: float64

In [9]:
# Categoricals (범주화)
# pd.to_numeric() : 함수를 이용한 문자열 칼럼의 숫자형 변환
# astype() : 메소드를 이용한 문자열 칼럼의 숫자형 변환

df5 = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df5["grade"] = df5["raw_grade"].astype("category")
df5["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [10]:
df5["grade"].cat.categories = ["very good", "good", "very bad"]
df5

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [11]:
df5["grade"] = df5["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
df5

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [12]:
df5.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [13]:
df5.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

In [14]:
# Plotting (그래프)

ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))
ts = ts.cumsum()
ts.plot()

In [8]:
df5 = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])  
df5 = df5.cumsum()
plt.figure(); df.plot(); plt.legend(loc='best')

NameError: name 'ts' is not defined

In [5]:
df.plot()
# Error: Direct kernel connection broken

In [ ]:
df.plot.bar()
# Error: Direct kernel connection broken

In [ ]:
df.plot.density()
# Error: Direct kernel connection broken